Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetStatus(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus})
Sets the result status of the calculation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.GetStatus
Returns array of result statuses for the paths.
Returns:
Resulting array of end points.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.GetPathOfTravelPoints
Retrieves the source or calculated points passed between Revit and calculation server.
Remarks:
Source points are start and end points plus all possible waypoints between them.
Calculated points are actual points of the PathOfTravel that are displayed in the view.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetPathOfTravelPoints(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ}})
Sets the source or calculated points passed between Revit and calculation server.
Remarks:
Source points are start and end points plus all possible waypoints between them.
Calculated points are actual points of the PathOfTravel that are displayed in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetEndPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.GetEndPoints
Returns array of the end points for the paths.
Returns:
Resulting array of end points.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.SetStartPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.GetStartPoints
Returns array of the start points for the paths.
Returns:
Resulting array of start points.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.TemporaryMode
True if temporary mode is ON for the view, false otherwise.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.OutlineArea
Area of the view outline.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.LineCount
Number of lines in the view.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.Request
The request type for the calculation.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.View
Gets the View which the path of travel is being calculated for.
Sets the View which the path of travel is being calculated for.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData.#ctor
Initializes PathOfTravelCalculationServiceData to a default, unusable state; Revit needs to make it usable
before passing it to the IPathOfTravelCalculationServer instance.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServiceData
This is a container for data and some functions which is passed from Revit to an instance of
IPathOfCalculationServer.
Since:
2020